Repository: Vinh-Beo/starbucks_order_application
Catalog: Project/Language/AppResources.*.resx
Languages: vi

source: Hot key
vi: Phím tắt

source: Sold event
vi: Sự kiện bán hàng

# Finish
source: is finish
vi: hoàn thành

# Start
source: is start
vi: bắt đầu

# Pause
source: is pause
vi: tạm dừng

# PleaseSelectLitreOrMoneyToSold
source: Please select litre/money to sold
vi: Vui lòng nhập số lít hoặc số tiền cần bán

# YouSelect
source: You selected
vi: Bạn đã chọn

source: Time
vi: Thời gian

source: Current Day
vi: Ngày hiện tại

source: Total orders
vi: Tổng số đơn hàng

source: Please check connection
vi: Vui lòng kiểm tra kết nối

# WarrantyDescriptionFail
source: Your device version can not support QR code warranty or invalid code
vi: Có thể thiết bị của bạn không hỗ trợ bảo hành điện tử hoặc mã không hợp lệ

# SomethingWrong
source: Something wrong. Please recheck...
vi: Có sai sót. Vui lòng kiểm tra...

# NotFoundDvInfo
source: Not found the device info
vi: Không tìm thấy thông tin thiết bị

# IsWarranty
source: WARRANTED
vi: CÒN BẢO HÀNH

# NotWarranty
source: NOT WARRANTED
vi: HẾT BẢO HÀNH

source: Product is not warranty
vi: Sản phẩm không nằm trong chế độ bảo hành

source: Product info
vi: Thông tin sản phẩm

source: months
vi: tháng

# TotalNos
source: Total notifications
vi: Tổng thông báo

# TDSOver
source: TDS values is over
vi: Chỉ số TDS vượt ngưỡng

# TDSOK
source: TDS value is going normal
vi: Chỉ số TDS trở lại bình thường

source: Add to cart
vi: Thêm vào giỏ

source: Medium
vi: Vừa

source: Large
vi: Lớn

source: Small
vi: Nhỏ

source: Provisional price
vi: Tạm tính

source: Total price
vi: Thành tiền

source: Cart
vi: Giỏ hàng

source: Buy
vi: Thanh toán

source: Search
vi: Tìm kiếm

# PromosHearder
source: Promos you can't resist
vi: Những quảng cáo bạn không thể cưỡng lại

# AppTitle
source: Vinh Beo Solution
vi: Giải pháp VinhBeo
