Repository: Vinh-Beo/starbucks_order_application
Catalog: Project/Language/AppResources.*.resx
Languages: vi

source: No answer
vi: Không xác định

source: ON
vi: BẬT

source: OFF
vi: TẮT

source: Total time on
vi: Tổng thời gian bật

source: Setup
vi: Thiết lập

source: Please Login
vi: Đăng nhập

source: User name
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

source: LOGIN
vi: ĐĂNG NHẬP

source: Version
vi: Phiên bản

# RememberPassword
source: Remember
vi: Nhớ mật khẩu

source: Help
vi: Trợ giúp

source: Doing login...
vi: Đang đăng nhập...

source: Login OK
vi: Đăng nhập thành công

source: Login fail. Please recheck...
vi: Đăng nhập thất bại. Vui lòng kiểm tra...

# PleaseConfigImportantSetting
source: Please config some important settings...
vi: Vui lòng thiết lập các thông tin quan trọng...

source: Network error. Please recheck...
vi: Lỗi kết nối mạng. Vui lòng kiểm tra...

# UsernameOrPasswordIsWrong
source: User name or password is wrong. Please recheck...
vi: Tên đăng nhập hoặc mật khẩu không đúng. Vui lòng kiểm tra...

# UserIsExpiredPleaseContactAdmin
source: User is expired. Please contact admin for support...
vi: Tài khoản hết hạn. Vui lòng liên hệ admin để được hỗ trợ...

# UserIsLockedPleaseContactAdmin
source: User is locked. Please contact admin for support...
vi: Tài khoản bị khóa. Vui lòng liên hệ admin để được hỗ trợ...

# Login_OKThenLoadAllData
source: Login OK. Start load all data...
vi: Đăng nhập thành công. Bắt đầu tải dữ liệu...

# Login_LoadDeviceInfoFail
source: Can not load device info. Please recheck...
vi: Không thể tải dữ liệu thiết bị. Vui lòng kiểm tra...

# Login_LoadUserInfoFail
source: Can not load user info. Please recheck...
vi: Không thể tải dữ liệu tài khoản. Vui lòng kiểm tra...

source: Device
vi: Thiết bị

source: Area
vi: Khu vực

source: Script
vi: Kịch bản

source: Notification
vi: Thông báo

source: Setting
vi: Thiết lập

source: Find gateway, line, device,...
vi: Tìm kiếm gateway, tuyến, đèn,...

source: Total gateways
vi: Tổng số gateway

source: Code
vi: Mã số

source: Total lines
vi: Tổng số tuyến

source: Detail information
vi: Thông tin chi tiết

source: Name
vi: Tên

source: Description
vi: Mô tả

source: Product code
vi: Mã số

source: Temperature
vi: Nhiệt độ

source: Working time
vi: Thời gian hoạt động

source: Status
vi: Trạng thái

source: hours
vi: giờ

source: Online
vi: Đang kết nối

source: Offline
vi: Mất kết nối

source: Last update time
vi: Cập nhật lần cuối

source: Online from
vi: Kết nối từ lúc

source: Offline at
vi: Mất kết nối lúc

source: Control
vi: Điều khiển

source: Notify and error
vi: Thông báo và lỗi

source: Power meter
vi: Đồng hồ đo điện

source: Output scheduler
vi: Lịch trình ngõ ra

source: Light and device scheduler
vi: Lịch trình đèn và thiết bị

source: Checking scheduler
vi: Lịch trình kiểm tra

# TotalTimeOn_Duplicate[1]
source: Total time on
vi: Tổng thời gian bật

source: Back
vi: Quay lại

source: Close
vi: Đóng

# TotalLines_Duplicate[1]
source: Total line
vi: Tổng số tuyến

source: Total lights
vi: Tổng số đèn

source: Index
vi: Số thứ tự

source: Type
vi: Loại

source: Line index
vi: Tuyến đèn thứ

source: At
vi: Lúc

source: Temperature is over
vi: Nhiệt độ thiết bị vượt ngưỡng

source: Temperature is going normal
vi: Nhiệt độ thiết bị bình thường

source: Current is over
vi: Dòng điện thiết bị vượt ngưỡng

source: Current is going normal
vi: Dòng điện thiết bị bình thường

# DeviceOnButNoCurrent
source: Device is on but no current
vi: Thiết bị bật nhưng không có dòng tải

source: Device on is going normal
vi: Thiết bị đã bật bình thường

# DeviceUsingByUnStableInput
source: Device is using unstable power supply
vi: Thiết bị đang được cấp nguồn không ổn định

# DeviceUsingByLowInput
source: Device is using low power supply
vi: Thiết bị đang được cấp nguồn điện áp thấp

# DeviceUsingByHighInput
source: Device is using high power supply
vi: Thiết bị đang được cấp nguồn điện áp cao

# DeviceReturnNormalInput
source: Power supply return normal
vi: Nguồn cung cấp thiết bị trở lại bình thường

# DeviceNotResponseWhenCheck
source: Device is not responded when system checking
vi: Thiết bị không phản hồi khi hệ thống kiểm tra

source: Output channel on but no voltage
vi: Ngõ ra bật nhưng không có điện

# OutputChannelOffButHasVoltage
source: Output channel off but still has voltage
vi: Ngõ ra tắt nhưng vẫn còn điện

# OutputChannelIsOK
source: Output channel is going normal operating
vi: Ngõ ra vận hành bình thường trở lại

# DeviceIsPowerOn
source: Device is powered on
vi: Thiết bị được bật nguồn

source: Device is reset
vi: Thiết bị được khởi động lại

source: Gateway channel
vi: Kênh gateway

source: Device has no any notifications or errors
vi: Thiết bị không có bất cứ thông báo hay lỗi nào

# VoltageP1
source: Voltage phase 1
vi: Điện áp pha 1

# VoltageP2
source: Voltage phase 2
vi: Điện áp pha 2

# VoltageP3
source: Voltage phase 3
vi: Điện áp pha 3

# CurrentP1
source: Current phase 1
vi: Dòng điện pha 1

# CurrentP2
source: Current phase 2
vi: Dòng điện pha 2

# CurrentP3
source: Current phase 3
vi: Dòng điện pha 3

# PowerP1
source: Power phase 1
vi: Công suất pha 1

# PowerP2
source: Power phase 2
vi: Công suất pha 2

# PowerP3
source: Power phase 3
vi: Công suất pha 3

source: Power total
vi: Công suất tổng

source: Frequency
vi: Tần số

source: Total consumption
vi: Điện năng tiêu thụ

source: Cancel
vi: Hủy

source: Update
vi: Cập nhật

source: Yes
vi: Có

source: No
vi: Không

source: Device setup
vi: Thiết lập thiết bị

# ChangeNameAndDes
source: Change name/description
vi: Đổi tên và mô tả

source: Scan device
vi: Quét để học thiết bị

source: Control history
vi: Lịch sử điều khiển

# DeviceName
source: Device's name
vi: Tên thiết bị

# DeviceDescription
source: Device's description
vi: Mô tả thiết bị

source: Change name
vi: Đổi tên

source: Change description
vi: Cập nhật mô tả

source: Doing update new name...
vi: Đang cập nhật tên mới...

source: Doing update new description...
vi: Đang cập nhật mô tả mới...

source: Sorry! You have no permission to do this action
vi: Xin lỗi! Bạn không đủ quyền để thực hiện hành động này

# SorryUnknownError
source: Sorry! Unknown error. Please recheck...
vi: Xin lỗi! Có lỗi không xác đinh. Vui lòng kiểm tra...

source: Scan and setup
vi: Quét và thiết lập

source: Line
vi: Tuyến

source: Total devices
vi: Tổng số thiết bị

source: Set another device
vi: Thiết lập thiết bị khác

# ScanDeviceHint
source: Scan and wait end device reponse information. Then select and try to control device to make sure this is correct device. After confirm, set new ID for it. If want to set another ID, check "Set another device and input new ID
vi: Quét và chờ thiết bị phản hồi thông tin. Sau đó chọn thiết bị cần thiết lập và điều khiển thử để xác nhận đúng thiết bị. Sau khi xác nhận, nhấn thiết lập ID mới. Nếu muốn thiết lập ID khác, Chọn "Thiết lập thiết bị khác" và nhập ID cần thiết lập

# DevicePasswordHint
source: For security, need to set password after set new ID to lock. Password is from 0 (not set) to 999999. After set password, at next scan and set ID, need to input old device password
vi: Vì lý do bảo mật, vui lòng thiết lập mật khẩu thiết bị sau khi thiết lập ID thành công để khóa thiết lập. Mật khẩu là số từ 0 (không mật khẩu) đến 999999. Sau khi thiết lập mật khẩu, lần quét và thiết lập ID sau phải nhập lại mật khẩu cũ

source: Set ID
vi: Thiết lập

source: Add new light line
vi: Thêm tuyến đèn mới

source: Sync light line to gateway
vi: Đồng bộ tuyến đèn

source: Setup gateway
vi: Thiết lập gateway

source: Set location
vi: Thiết lập vị trí

source: Add new virtual line
vi: Thêm tuyến đèn "ảo" mới

source: Advance
vi: Nâng cao

source: Delete gateway
vi: Xóa gateway

# DeleteGwWarning
source: Do you really want to delete this gateway? 1. Delete all linker hardware line and street light which is managed by this gateway 2. All gateway config will be deleted 3. All permission of control users involve thi this gateway will not applied
vi: Bạn thật sự muốn xóa gateway này? 1. Xóa gateway thì sẽ xóa tất cả các tuyến đèn và đèn có liên quan 2. Tất cả cấu hình của gateway sẽ bị xóa vĩnh viễn 3. Các phân quyền tài khoản đến gateway sẽ bị vô hiệu

source: Warning
vi: Cảnh báo

source: Delete
vi: Xóa

source: Input serial
vi: Nhập mã số

source: Scan QR code
vi: Quét mã QR

source: Check
vi: Kiểm tra

# InputSerialDescription
source: Serial number is in label, include device package. If can not found, please contact manufacturing for support
vi: Mã số được in trên tem đính kèm thiết bị. Nếu không thể tìm thấy, vui lòng liên hệ nhà sản xuất để đc hỗ trợ

# GatewayIsNotExistPleaseRecheck
source: Gateway is not exist or serial code is invalid. Please recheck...
vi: Gateway không tồn tại hoặc mã số không hợp lệ. Vui lòng kiểm tra...

# DoingCheckSerial
source: Doing check serial number. Please wait...
vi: Đang kiểm tra mã số. Vui lòng đợi...

source: Device is valid
vi: Thiết bị hợp lệ

source: Add new
vi: Thêm mới

# AddNewGatewayIsOK
source: Add new gateway OK
vi: Thêm mới gateway thành công

source: Set name
vi: Đặt tên

source: Set index
vi: Đặt số thứ tự

source: Next
vi: Tiếp

source: Set total dimer light
vi: Thiết lập số lượng đèn dimer

source: Set total timer
vi: Thiết lập số lượng bộ hẹn giờ

source: Total timers
vi: Tổng số bộ hẹn giờ

source: Doing add new light line...
vi: Đang thêm mới tuyến đèn...

# CreateNewLightLineOK
source: Create new light line is OK
vi: Tạo mới tuyến đèn thành công

source: Please select another line index
vi: Vui lòng chọn số thứ tự tuyến đèn khác

source: Line name
vi: Tên tuyến

source: Line description
vi: Mô tả tuyến

source: Update device on line
vi: Cập nhật thiết bị trên tuyến

source: Doing update device on line...
vi: Đang cập nhật tổng số thiết bị trên tuyến...

# UpdateDeviceOnLineOK
source: Update device on line is OK
vi: Cập nhật thiết bị trên tuyến thành công

source: Set new ID OK
vi: Thiết lập ID mới thành công

source: Set new ID fail. Please recheck...
vi: Thiết lập ID mới thất bại. Vui lòng kiểm tra...

source: Management
vi: Quản lý

source: Delete all
vi: Xóa tất cả

# DeleteDvNotifyWarning
source: 1. Delete all will be deleted forever all notifies and errors of this device and can not restore 2. Only delete all notifications and errors until now, and continue record all new notifications and errors on system.
vi: 1. Xóa tất cả xóa vĩnh viễn và không thể khôi phục lại nội dung thông báo và lỗi 2. Chỉ xóa các thông báo và lỗi đến thời điểm hiện tại, các thông báo và lỗi phát sinh sau thời điểm này vẫn được ghi nhận lại trên hệ thống.

# DoingDeleteAllNotify
source: Doing delete all notification...
vi: Đang xóa tất cả các thông báo và lỗi

# DeleteAllNotifyOK
source: Delete all notification OK
vi: Xóa thông báo và lỗi thành công

# DeleteAllNotifyFail
source: Delete all notification fail. Please recheck...
vi: Xóa thông báo và lỗi thất bại. Vui lòng kiểm tra...

# TotalLineLightIsOver100
source: Total line light is reach max (over 100). Please recheck...
vi: Tổng số tuyến quá nhiều (> 100). Vui lòng kiểm tra...

# CanNotConnectToCloud
source: Can not connect to cloud. Please recheck...
vi: Không thể kết nối đến dịch vụ đám mây. Vui lòng kiểm tra...

# CanNotSyncToGateway
source: Can not sync to gateway. Please recheck...
vi: Không thể đồng bộ xuống thiết bị. Vui lòng kiểm tra...

source: Sync light line to gateway OK
vi: Đồng bộ danh sách tuyến đèn xuống thiết bị thành công

# DoingSyncLightLine
source: Doing sync light line to gateway...
vi: Đang đồng bộ danh sách tuyến đèn...

# BiggerThan0AndSmaller
source: Bigger than 0 and smaller than
vi: Lớn hơn 0 và nhỏ hơn

source: Invalid value. Please recheck...
vi: Giá trị không hợp lệ. Vui lòng kiểm tra...

source: Doing add new virtual line...
vi: Đang thêm tuyến đèn ảo mới...

# AddNewVirtualLineOK
source: Add new virtual line is OK
vi: Thêm tuyến đèn ảo mới thành công

# AddNewVirtualLineFail
source: Add new virtual line is OK. Please recheck...
vi: Thêm tuyến đèn ảo mới thất bại. Vui lòng kiểm tra...

# VirtualLineIsExistSelectAnotherIndex
source: Virtual line is existed. Select another index
vi: Tuyến đèn ảo đã tồn tại. Chọn số thứ tự khác

source: Virtual line
vi: Tuyến ảo

source: From 0 to
vi: Từ 0 đến

source: From 1 to
vi: Từ 1 đến

source: Delete line
vi: Xóa tuyến đèn

# DeleteLineOK
source: Delete line is OK
vi: Xóa tuyến đèn thành công

# SetAnotherDeviceHint
source: When scan new device, if found another device is valid with another ID, can set override
vi: Trong quá trình quét và học thiết bị mới, nếu thấy thiết bị phù hợp với số ID khác, có thể chọn và thiết lập đè

# UpdateNewNameOK
source: Update new name is OK
vi: Cập nhật tên mới thành công

# UpdateDescriptionOK
source: Update description is OK
vi: Cập nhật mô tả thành công

source: Total scripts
vi: Tổng số kịch bản

source: Loading scripts data...
vi: Đang tải dữ liệu kịch bản...

# IsActivate
source: Activated
vi: Đang hoạt động

source: Activate
vi: Kích hoạt

source: Deactivate
vi: Tạm ngưng

source: Not activate
vi: Đang tạm khóa

source: Create new script
vi: Tạo kịch bản mới

# CreateNewScriptOK
source: Create new script is OK
vi: Tạo mới kịch bản thành công

source: Delete script
vi: Xóa kịch bản

# DeleteScriptWarning
source: Do you really want to delete this script. All data will be deleted forever
vi: Bạn thật sự muốn xóa kịch bản này? Tất cả dữ liệu sẽ được xóa vĩnh viễn

# ScriptIsNotExisted
source: Sorry! Script is not existed
vi: Xin lỗi! Kịch bản không tồn tại

source: Doing delete script...
vi: Đang xóa kịch bản...

# DeleteScriptOK
source: Delete script is OK
vi: Xóa kịch bản thành công

source: Set timer
vi: Thiết lập hẹn giờ

source: Set content power on
vi: Thiết lập nội dung bật nguồn

source: Set content device
vi: Thiết lập nội dung thiết bị

source: Dayweek
vi: Ngày trong tuần

source: Mask all dayweek
vi: Chọn tất cả ngày trong tuần

source: Clear all dayweek
vi: Xóa tất cả ngày trong tuần

source: Delete timer
vi: Xóa hẹn giờ

source: Sorry! You can not add more
vi: Xin lỗi! Bạn không thể tạo thêm

# SorryThisScriptIsDeactivateCanNotControl
source: Sorry! This script is deactivated, can not control now. Please actiavte it again
vi: Xin lỗi! Kịch bản đang tạm khóa. Không thể điều khiển. Vui lòng kích hoạt lại

source: Total event
vi: Tổng số sự kiện

source: Support phone
vi: Số điện thoại hỗ trợ

source: Primary support phone
vi: Số điện thoại hỗ trợ chính

source: secondary support phone
vi: Số điện thoại hỗ trợ phụ

# SupportPhoneDescription
source: Support phone is using emegency situration, operator can use support phones to control basic function via SMS or reset device via call.
vi: Số điện thoại hỗ trợ trong tình huống khẩn cấp. Người vận hành có thể sử dụng những số này để điều khiển các tính năng cơ bản qua SMS hoặc khởi động lại thiết bị bằng cuộc gọi đặc biệt đến thiết bị.

source: Buzzer setup
vi: Thiết lập loa

# BuzzerDescription
source: Buzzer will bip when has new event or control. If you want device working in silent, turn off buzzer. You should turn on buzzer when setup device to check
vi: Loa sẽ kêu khi có sự kiện hoặc điều khiển. Nếu bạn muốn thiết bị hoạt động trong chế độ yên lặng, hãy tắt loa. Nên bật loa trong quá trình thiết lập để dễ dàng kiểm tra

source: GMT setup
vi: Thiết lập GMT

# GMTSetupDescription
source: Setup GMT will help device can run automatic feature correctly, match with current real GMT of your reagion
vi: Thiết lập GMT giúp thiết bị chạy các tác vụ tự động hẹn giờ chính xác với khu vực GMT hiện tại của bạn

source: Temperature threadhold
vi: Ngưỡng nhiệt độ

# TemperatureThreadholdDescription
source: When device is working at high temperature is config at "temperature threadhold", system will send notification to alert operator. And when device is running on normal, alert is off
vi: Khi thiết bị hoạt động ở nhiệt độ cao đc cấu hình bởi "ngưỡng nhiệt độ (*C)", hệ thống sẽ gởi cảnh báo đến người vận hành, và cảnh báo sẽ tắt khi thiết bị vận hành bình thường trở lại

source: Please input correct phone number
vi: Vui lòng nhập số điện thoại chính xác

# TemperatureThreadHoldValueIsNotCorrect
source: Temperature threadhold is not correct
vi: Ngưỡng nhiệt độ không chính xác

source: GMT value is not correct
vi: Giá trị GMT không chính hợp lệ

source: Doing sync to device....
vi: Đang đồng bộ xuống thiết bị....

# CanNotSyncToDevice
source: Can not sync to device. Please recheck....
vi: Không thể đồng bộ xuống thiết bị. Vui lòng kiểm tra....

# IsSynced
source: Synced
vi: Đã đồng bộ

source: Not synced
vi: Chưa được đồng bộ

source: Setup device is OK
vi: Thiết lập thiết bị thành công

source: Backup setup to cloud
vi: Lưu dự phòng thiết lập lên cloud

source: Display layer
vi: Lớp hiển thị

source: Street light
vi: Đèn đường

source: Timer
vi: Bộ hẹn giờ

source: OK
vi: Đồng ý

# MovePositionHelp
source: 1. Pick and hold icon until can drag 2. Drag and drop icon to new position 3. If finish, press again icon move position to exit mode
vi: 1. Nhấn chọn và giữ icon cho đến khi có thể kéo thả 2. Di chuyển và thả đến vị trí mong muốn 3. Sau khi hoàn thành, nhấn lần nữa nút di chuyển để thoát chế độ

# MovePosition
source: Move new potion
vi: Di chuyển vị trí

# UpdateNewDeviceLocation
source: Update new device's location
vi: Cập nhật vị trí thiết bị

# UpdateNewDeviceLocationFail
source: Update new device's location fail. Please recheck...
vi: Cập nhật vị trí thiêt bị thất bại. Vui lòng kiểm tra...

# FinishMoveLocation
source: Finish move/change location for devices
vi: Hoàn tất di chuyển thay đổi bị trí thiết bị

source: About
vi: Thông tin

source: Config server
vi: Cấu hình server

# ConfigServerHint
source: input "DF"for default server
vi: nhập "DF"cho server mặc định

# ConfigServerDescription
source: By default, application connect to cloud server. If you has delicate server, please input config string which is released by admin
vi: Mặc định ứng dụng sẽ kết nối với hệ thống máy chủ đám mây. Nếu bạn có cấu hình máy chủ riêng, vui lòng nhập thông tin cấu hình đã được người quản lý phát hành

source: Doing restore default config...
vi: Đang khôi phục thiết lập mặc định...

# RestoreConfigOK
source: Restore config is OK
vi: Khôi phục thiết lập mặc định thành công

# RestoreConfigFail
source: Restore config is fail. Please recheck...
vi: Khôi phục thiết lập mặc định thất bại. Vui lòng kiểm tra...

# CopyRightS3
source: Copyright 2022 vjnhbeo@gmail.com
vi: Bản quyền 2022 vjnhbeo@gmail.com

source: Hotline
vi: Đường dây nóng

source: Information
vi: Thông tin

# SorryCantNotFoundInfo
source: Sorry! Can not found info. Please recheck...
vi: Xin lỗi! không tìm thấy thông tin. Vui lòng kiểm tra..

# ConfigServerOK
source: Config delicate server is OK
vi: Cấu hình server riêng thành công

# DoingConfigServer
source: Doing config server info...
vi: Đang cấu hình thông tin server...

source: Type of control mask
vi: Kiểu nhóm điều khiển

source: Motion sensor
vi: Cảm biến chuyển động

# MotionSensorDescription
source: Motion sensor is mode auto detect motion of human or vehical, it will increase light automatically if mode is activated
vi: Chế độ cảm biến chuyển động là chế độ tự nhận dạng khi có người hoặc phương tiện di chuyển, đèn sẽ tự động tăng dộ sáng cho phù hợp

# ControlVirtualDescription
source: 1. System can support control virtual device but when control only one device on line, all device in this line will be received this control action 2. Virtual line can not control dim
vi: 1. Hệ thống hỗ trợ việc điều khiển thiết bị ảo, nhưng khi điều khiển 1 thiết bị trên tuyến, tất cả các đèn trên tuyến đều nhận hành động điều khiển này 2. Đèn ảo không thể điều khiển theo mức độ

source: User
vi: Tài khoản

# ChangeUsernameAndPass
source: Change username and password
vi: Đổi tên đăng nhập và mật khẩu

# UpdateInfo
source: Update information
vi: Cập nhật thông tin

source: Set default location
vi: Thiết lập vị trí mặc định

source: Help and guideline
vi: Trợ giúp hướng dẫn

source: Application guideline
vi: Hướng dẫn sử dụng ứng dụng

source: Gateway guideline
vi: Hướng dẫn sử dụng gateway

source: Sign out
vi: Đăng xuất

source: Current password
vi: Mật khẩu hiện tại

source: New password
vi: Mật khẩu mới

source: Confirm new password
vi: Xác nhận mật khẩu mới

source: New password and confirm new password is not match
vi: Mật khẩu mới và xác nhận mật khẩu mới không trùng khớp

source: Current password is wrong
vi: Sai mật khẩu hiện tại

source: User name is existed. Please select another...
vi: Tên đăng nhập bị trùng. Vui lòng chọn tên khác...

# ChangeUsernameAndPassWarning
source: 1. After change user name and password successfully, application will be sign out automatically 2. If change to new username and password, other machine is using this account will be forced sign out
vi: 1. Sau khi thay đổi tên đăng nhập và mật khẩu thành công ứng dụng sẽ tự động thoát 2. Nếu thay đổi thông tin đăng nhập mới, tất cả các thiết bị khac đang dùng thông tin cũ sẽ tự động thoát

source: Please input username
vi: Vui lòng nhập tên đăng nhập

source: Do not input username has special character
vi: Tên đăng nhập phải không có ký tự đặc biệt

source: Please input old password
vi: Vui lòng nhập mật khẩu cũ

source: Do not input old password has special character
vi: Mật khẩu cũ phải không có ký tự đặc biệt

source: Please input new password
vi: Vui lòng nhập mật khẩu mới

source: Do not input new password has special character
vi: Mật khẩu mới phải không có ký tự đặc biệt

source: Please input confirm new password
vi: Vui lòng nhập xác nhận mật khẩu mới

source: Do not input confirm new password has special character
vi: Xác nhận mật khẩu mới phải không có ký tự đặc biệt

source: Doing change username and password...
vi: Đang thay đổi tên đăng nhập và mật khẩu...

source: Update username and password is done. Sign out...
vi: Cập nhật tên đăng nhập và mật khẩu thành công. Đang đăng xuất...

source: Phone number
vi: Số điện thoại

source: Update user info is OK
vi: Cập nhật thông tin tài khoản thành công

source: Please input display name
vi: Vui lòng nhập tên hiển thị

source: Do not input display name has special character
vi: Vui lòng không nhập tên hiển thị có ký tự đặc biệt

source: Saving script timer...
vi: Đang lưu hẹn giờ kịch bản...

source: Display name
vi: Tên hiển thị

# UpdateUserInfoWarning
source: 1. Please input correct email and phone number 2. Incase you need support, we will contact to you
vi: 1. Vui lòng cung cấp thông tin email và số điện thoại chính xác 2. Trong trường hợp bạn cần hỗ trợ, chúng tôi sẽ liên lạc qua thông tin này

# UpdateUserLocationOK
source: Update user location is OK
vi: Cập nhật vị trí mặc định thành công

# CameraQRNotSupport
source: Camera is not support
vi: Máy ảnh không có hoặc không hỗ trợ

# CameraQRNotSupportPleaseSetPermission
source: Camera for QR scaner is not support Please set permission for camera...
vi: Camera hiện tại không được cấp quyền để quét mã QR Vui lòng cấp quyền truy cập camera...

# WaterRefinneTitle
source: Water refine solution
vi: Giải pháp lọc nước tự động

source: Orders
vi: Đơn hàng

source: Sold
vi: Bán hàng

source: Price Unit
vi: Đơn giá

source: Litre
vi: Lít

# NoDevicePleaseAddNew
source: Your system has no any devices. Please add new...
vi: Hệ thống của bạn chưa có bất kỳ thiết bị nào. Vui lòng thêm mới...

# NoDevicePleaseAddNewDescription
source: Hint how to add new device: 1. Make sure your center device is online. 2. Scan QR code in device. If has valid QR code, a new device will be add. 3. Sign out then sign in application again to refresh
vi: Hướng dẫn học mới thiết bị: 1. Hãy đảm bảo thiết bị trung tâm đang kết nối mạng. 2. Sử dụng máy ảnh, quét mã số QR in trên thiết bị. Nếu mã hợp lệ thiết bị sẽ được thêm vô 3. Thoát và đăng nhập lại ứng đụng để làm mới

source: Money
vi: Số tiền

source: Set value and control
vi: Nhập và điều khiển bán hàng

source: Sold info session
vi: Thông tin phiên bán hàng
